[
    {
        "input": "I'd like to spend the next hour or so with you talking about reminiscence therapy. If you're in psychology, social work, or nursing, you might not have come across reminiscence therapy in your training. I certainly didn't get any training and really stumbled across it in some of my work in the US. But I want to share our experiences, challenges, and what we’ve learned about using reminiscence therapy with older adults.",
        "response": "That sounds interesting! What have you learned about reminiscence therapy and its impact on older adults?"
    },
    {
        "input": "Over the last decade or so, we've been really trying to understand how we can be helpful to older people and improve their emotional well-being and quality of life. This is quite important, isn't it? Currently, there are more older adults now than ever before. By 2050, about 25% of us will be classified as older (65+). What does it mean to have quality of life as we age? What makes people happy in late life?",
        "response": "Thats a critical question. Have you found any common factors that contribute to well-being in older adults?"
    },
    {
        "input": "Do you think your training in the military and your way of working have prepared you for the future?",
        "response": "My training started back home with my mom. She was strict. She had me get up and go to school every day, we were poor. Not that we didn't have food to eat or clothes to wear. But we had to wash her underwear socks, put them in on the heater, so that they could dry for school the next day. I had to put paper in the bottom of my shoes, because we had holes in them. We learn to appreciate a lot of things. If I made $10 I gave up $9 for the house."
    },
    {
        "input": "So you developed a work ethic? You had structure in your day. You didn't take things for granted because things were a struggle for you. You learned to be responsible at that very early age?",
        "response": "Yeah."
    },
    {
        "input": "How have all these helped you in your adult life?",
        "response": "I do my best at my jobs. I've never been fired off a job."
    },
    {
        "input": "Over the course of your life, you have developed certain skills, certain ways of thinking. Do you think they have helped you through the course of your life?",
        "response": "Oh, yeah."
    },
    {
        "input": "What was schooling like for you as a child?",
        "response": "I had to put paper in the bottom of my shoes, because we had holes in them."
    },
    {
        "input": "That must have been tough. Did you have any favorite teachers or subjects?",
        "response": "I liked history. My teacher made the stories come alive."
    },
    {
        "input": "Tell me about a memory with your teacher.",
        "response": "He used to tell us stories about his time in the war. It made history feel real, like it wasn't just in books."
    }
]